the_beautiful_game/app/controllers/sessions_controller.rb

	def create
		@user = User.find_by_email(params[:session][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "rohtaswadera@gmail.com"], ["LIMIT", 1]]