the_beautiful_game/app/controllers/teams_controller.rb

	def show
		@team = Team.find(params[:id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@team = Team.new(team_params)

		if @team.save
---
INSERT INTO "teams" ("team", "flag", "founded", "moments", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

	def edit
		@team = Team.find(params[:id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@team = Team.find(params[:id])

		if @team.update(team_params)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "teams" SET "flag" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["flag", "PNE_FC.png"], ["updated_at", "2017-11-14 21:38:21.419006"], ["id", 1]]

	def destroy
		@team = Team.find(params[:id])
		@team.destroy
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "teams" WHERE "teams"."id" = $1  [["id", 2]]